export const visualizationsNotFound = {
    'en': 'Visualizations not found',
    'hi': 'नहीं मिला',
    'ml': 'കാണ്മാനില്ല',
    'mr': 'सापडले नाही',
    'bn': 'ভিজ্যুয়ালাইজেশন পাওয়া যায় নি'
}

export const selectEntity = {
    'en': 'Select any entity/topic',
    'hi': 'किसी भी इकाई / विषय को दबाएं',
    'ml': 'ഏതെങ്കിലും എന്റിറ്റി / വിഷയം തിരഞ്ഞെടുക്കുക',
    'mr': 'कोणतीही घटक / विषय निवडा',
    'bn': 'যে কোনও সত্তা / বিষয় নির্বাচন করুন'
};

export const selectTwoEntities = {
    'en': 'Select two topics to connect',
    'hi': 'दो विषयों का चयन करे',
    'ml': 'രണ്ട് വിഷയങ്ങൾ തിരഞ്ഞെടുക്കുക',
    'mr': 'दोन विषय निवडा',
    'bn': 'দুটি বিষয় নির্বাচন করুন'
};

export const selections = {
    'en': 'Selections',
    'hi': 'विषय',
    'ml': 'തിരഞ്ഞെടുക്കലുകൾ',
    'mr': 'निवडी',
    'bn': 'নির্বাচন'
}

export const mindMap = {
    'en': 'Mindmap',
    'hi': 'मन नक्शा',
    'ml': 'മൈൻഡ്മാപ്പ്',
    'mr': 'मनाचा नकाशा',
    'bn': 'মাইন্ড মানচিত্র'
}

export const mindMapTooltips = {
    title:{
        'en': 'Mindmap view',
        'hi': 'मन नक्शा',
        'ml': 'മൈൻഡ്മാപ്പ് കാഴ്ച',
        'mr': 'मनाचा नकाशा',
        'bn': 'মাইন্ড মানচিত্র'    
    },
    desc:{
        'en': 'Visualise the story as a mindmap! Select any topic from the mindmap to read all about that topic.',
        'hi': 'कहानी को मन-नक्शा के रूप में देखें! उस विषय के बारे में पढ़ने के लिए मन-नक्शा से किसी भी विषय को दबाएं।',
        'ml': 'സ്റ്റോറി ഒരു മൈൻഡ് മാപ്പായി ദൃശ്യവൽക്കരിക്കുക! ആ വിഷയത്തെക്കുറിച്ച് എല്ലാം വായിക്കാൻ മൈൻഡ്മാപ്പിൽ നിന്ന് ഏതെങ്കിലും വിഷയം തിരഞ്ഞെടുക്കുക.',
        'mr': 'कल्पित मनाने कल्पित कथा बनवा! त्या विषयाबद्दल सर्व वाचण्यासाठी मानसिकतामधून कोणताही विषय निवडा',
        'bn': 'কাহিনীটিকে মন মানচিত্র হিসাবে ভিজ্যুয়ালাইজ করুন! সেই বিষয়টি সম্পর্কে সমস্ত কিছু পড়তে মনম্যাপ থেকে যে কোনও বিষয় নির্বাচন করুন।'    
    }
}

export const gameifiedMindMapTooltips = {
    title:{
        'en': 'Match the topics',
        'hi': 'मन नक्शा',
        'ml': 'മൈൻഡ്മാപ്പ് കാഴ്ച',
        'mr': 'मनाचा नकाशा',
        'bn': 'মাইন্ড মানচিত্র'    
    },
    desc:{
        'en': 'Fill the connections in the mindmap! Select two nodes to try to connect them! Correct connection will increase your score.',
        'hi': 'मन नक्शा में अंतराल भरें! उन्हें कनेक्ट करने का प्रयास करने के लिए दो नोड का चयन करें! सही कनेक्शन आपके स्कोर को बढ़ाएगा।',
        'ml': 'മൈൻഡ്മാപ്പിലെ വിടവുകൾ പൂരിപ്പിക്കുക! അവ ബന്ധിപ്പിക്കാൻ ശ്രമിക്കുന്നതിന് രണ്ട് നോഡുകൾ തിരഞ്ഞെടുക്കുക! ശരിയായ കണക്ഷൻ നിങ്ങളുടെ സ്കോർ വർദ്ധിപ്പിക്കും.',
        'mr': 'मनातील नकाशामधील अंतर भरा! त्यांना जोडण्याचा प्रयत्न करण्यासाठी दोन नोड निवडा! योग्य कनेक्शनमुळे आपली धावसंख्या वाढेल.',
        'bn': 'শূন্যস্থান পূরণ করুন মনম্যাপে! দুটি সংযোগ স্থাপনের চেষ্টা করার জন্য দুটি নোড নির্বাচন করুন! সঠিক সংযোগ আপনার স্কোর বাড়িয়ে তুলবে।'    
    }
}

export const gameifiedTimelineTooltips = {
    title:{
        'en': 'Fill the dates',
        'hi': 'मन नक्शा',
        'ml': 'മൈൻഡ്മാപ്പ് കാഴ്ച',
        'mr': 'मनाचा नकाशा',
        'bn': 'মাইন্ড মানচিত্র'    
    },
    desc:{
        'en': 'Fill the dates of the event in the cuecard! Select a date from the options! Correct selections will increase your score.',
        'hi': 'मन नक्शा में अंतराल भरें! उन्हें कनेक्ट करने का प्रयास करने के लिए दो नोड का चयन करें! सही कनेक्शन आपके स्कोर को बढ़ाएगा।',
        'ml': 'മൈൻഡ്മാപ്പിലെ വിടവുകൾ പൂരിപ്പിക്കുക! അവ ബന്ധിപ്പിക്കാൻ ശ്രമിക്കുന്നതിന് രണ്ട് നോഡുകൾ തിരഞ്ഞെടുക്കുക! ശരിയായ കണക്ഷൻ നിങ്ങളുടെ സ്കോർ വർദ്ധിപ്പിക്കും.',
        'mr': 'मनातील नकाशामधील अंतर भरा! त्यांना जोडण्याचा प्रयत्न करण्यासाठी दोन नोड निवडा! योग्य कनेक्शनमुळे आपली धावसंख्या वाढेल.',
        'bn': 'শূন্যস্থান পূরণ করুন মনম্যাপে! দুটি সংযোগ স্থাপনের চেষ্টা করার জন্য দুটি নোড নির্বাচন করুন! সঠিক সংযোগ আপনার স্কোর বাড়িয়ে তুলবে।'    
    }
}

export const timeline = {
    'en': 'Timeline',
    'hi': 'घटनाक्रम',
    'ml': 'ടൈംലൈൻ',
    'mr': 'टाइमलाइन',
    'bn': 'সময়রেখা'
}

export const timelineTooltips = {
    title:{
        'en': 'Timeline view',
        'hi': 'घटनाक्रम',
        'ml': 'ടൈംലൈൻ കാഴ്ച',
        'mr': 'टाइमलाइन दृश्य',
        'bn': 'সময়রেখা'    
    },
    desc:{
        'en': 'Visualise the story as a timeline!',
        'hi': 'एक घटनाक्रम के रूप में कहानी की कल्पना करो!',
        'ml': 'സ്റ്റോറി ഒരു ടൈംലൈനായി ദൃശ്യവൽക്കരിക്കുക!',
        'mr': 'टाइमलाइन म्हणून कथेचे दृश्य करा!',
        'bn': 'একটি সময়রেখা হিসাবে গল্পটি ভিজ্যুয়ালাইজ করুন!'    
    }
}